// приведення до Буля на прикладі Boolean(value)

// 0, NaN, null, undefined, " ", ' ' завжди буде false все остальне true
// console.log(Boolean(NaN));



// Логічний оператор И ( && )
// Зупиняється на брехні(false) і вертає те на чому зупинилось або остатній оперант

// console.log(5 && 6 && 7 && 'mango');  // верне 'mango'
// console.log(5 && 6 && 0 && 'mango')  // верне 0 нуль це false



// Логічний оператор ИЛИ ( || )
// Зупиняється на правді(true) і вертає те на чому зупинилось або остатній оперант

// console.log(0 || 7 || 8 || 10);  // верне 7
// console.log(0 || false || 8 || 10);  // верне 8
// console.log(0 || false || 0 || null);  // верне null як останній оперант

// Логічний оператор НЕ ( ! )
// Це типу інверсії, з початку переводить в буль (true/false) а тоді робить інверсію з true ---> false або навпаки.

// console.log(!true); // верне false
// console.log(!5); // з початку переводить в буль і отримаємо true а тоді робить інверсію true ---> false і вертає false.