// Основи ООП: класс, єкземпляр (обєкт), інтерфейс


// Функціїї - конструктори
//     - Іменовані
//     - Оператор new
//     - властивість Function.prototype

const Car = function (brand, model, price) { // це функція конструктор \клас\ ( назва функції повинна бути з великої букви і в одинарному)
    this.brand = brand;
    this.model = model;
    this.price = price;
    // функція визивається в контексті створеного обєкта (new Car) тобто this буде звертатись до (new Car)
};   

const myCar = new Car('Audi', 'Q3', 35000); //екземпляр функціїї конструктор Оператор new створю екземпляр (пустий обєкт)
const myCar2 = new Car(); 