// Підрахувати загальну суму чотних чисел
// // 1 зробити змінну total
// // 2 перебрати масив
// // 3 на кожній ітерації перевірити елемент на чьотність
// // 4 якщо елемент чьотний плюсуєм до тотала

const numbers = [1, 5, 8, 9, 12, 4, 15, 27, 30, 18, 11];

let total = 0;  // 1 зробити змінну total

// for (let i = 0; i < numbers.length; i += 1) {  // 2 перебрати масив
//     console.log(numbers[i]);

//     if (numbers[i] % 2 === 0) {   // 3 на кожній ітерації перевірити елемент на чьотність  ( рахує не чьотні !==)
//         console.log('ура чьотні');

//         total += numbers[i];  // 4 якщо елемент чьотний плюсуєм до тотала
//     }
// }
// console.log('Total ', total);


// // можна через for...of

// for (const number of numbers) {
//     if (numbers[i] % 2 === 0) {  
        
//         console.log('ура чьотні');

//         total += numbers[i];  
//     }
// }
// console.log('Total ', total);