// Напиши скрипт пошуку самого малого числа в масиві
// число повинні бути унікальні не повторюватись


// const numbers = [51, 18, 13, 24, 7, 85, 19];
// let smallestNumber = numbers[0]; // створюю змінну щоб зберігати найменше число і ставлю перший 1тем масиву як найменьше число

// for (const number of numbers) { // перебераю всі числа
//     console.log();
//     if (number < smallestNumber) { // тут рівняю їх з найменьшим яке я поставив (перший ітем масиву)
//         smallestNumber = number;  // якщо воно меньше ніж smallestNumber то записую в змінну
//     }
// }
// console.log( 'найменьше число 'smallestNumber);



