// Напиши скрип для обробки покупкі в магазині.

// баланс користувача лежить в змінній balance
// сума закупу лежить в змінній Payment

// Перед перевіркою вивисти повідомлення:
// "Загальна ціна замовлення [число] кредитів. Перевіряєм кількість доступних кредитів"

// Якщо сумма не перевищує баланс
//     - відняти з балансу суму покупки
//     - вивисти повідомлення(На рахунку залишилось[число] кредитів)
// Якщо сумма перевищує баланс
//     - вивисти повідомлення(На рахунку не достатньо коштів)
// Вкінці вивсти повідомлення (операція завершенна)


let balance = 10000;
const payment = 6000;

console.log(`Загальна ціна замовлення ${payment} кредитів. Перевіряєм кількість доступних кредитів`); // вивожу повідомлення

if (balance >= payment) {   // спочатку провіряю баланс чи вистачає коштів
    balance -= payment;     // віднімаю з балансу суму покупки 
    console.log(`На рахунку залишилось ${balance} кредитів`);  // вивожу повідомлення
} else {  // якщо коштив не вистачить виконується цей код
    console.log('На рахунку не достатньо коштів');  
}

console.log('Oперація завершенна'); // вивожу повідомлення