// //------- операторb сравнения

// console.log(5 > 5); //---->  повертає нам false або true
// console.log(5 == 5);
// console.log(5 != 5);

// //------- Перетворення типів рядка в число (тоб то '5' буде як 5 )

// console.log(10 > '5');
// console.log(5 == '5');
// console.log(5 != '5');
// console.log(1 == true);

// //------- Оператори рівності і не рівності ( === !== ) коли використовуєш іх не робиться переобразования рядка в числа а просто порівнюються

// console.log(5 === '5');
// console.log(5 === 5);
// console.log(5 !== '5');
// console.log(5 === 5);
// console.log(1 === true);